YasinSHV/MusicMaster-STM32/MusicMaster/Core/Src/main.c
	}
}

//UART END

void display_number(int led_flag, int _number) {
	HAL_GPIO_WritePin(GPIOD,
	GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4, GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOD, led[led_flag], DISPLAY_ON);
	if (_number != 0) {
		HAL_GPIO_WritePin(GPIOD, digits[_number].pattern, GPIO_PIN_SET);
	}
	HAL_GPIO_WritePin(GPIOD, digits[_number].anti_pattern, GPIO_PIN_RESET);
}

void increase(int _head) {
	carrier[_head] += 1;
	if (carrier[_head] == 10) {
		carrier[_head] = 0;
	}
}

void init_display() {
	HAL_GPIO_WritePin(GPIOD,
	GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4, GPIO_PIN_SET);
}

void initTonesDictionary() {
    playlist = initDictionary(10);

    // Example tones
    struct Tone super_mario_bros[]={{2637,306},{0,153},{2637,153},{0,153},{2093,153},{2637,153},{0,153},{3136,153},{0,459},{1586,153},{0,459},{2093,153},{0,306},{1586,153},{0,306},{1319,153},{0,306},{1760,153},{0,153},{1976,153},{0,153},{1865,153},{1760,153},{0,153},{1586,204},{2637,204},{3136,204},{3520,153},{0,153},{2794,153},{3136,153},{0,153},{2637,153},{0,153},{2093,153},{2349,153},{1976,153},{0,306},{2093,153},{0,306},{1586,153},{0,306},{1319,153},{0,306},{1760,153},{0,153},{1976,153},{0,153},{1865,153},{1760,153},{0,153},{1586,204},{2637,204},{3136,204},{3520,153},{0,153},{2794,153},{3136,153},{0,153},{2637,153},{0,153},{2093,153},{2349,153},{1976,153},{0,0}};
    struct Tone hedwig_theme[]={{REST,750},{NOTE_D4,374},{NOTE_G4,561},{NOTE_AS4,187},{NOTE_A4,374},{NOTE_G4,750},{NOTE_D5,374},{NOTE_C5,1124},{NOTE_A4,1124},{NOTE_G4,561},{NOTE_AS4,187},{NOTE_A4,374},{NOTE_F4,750},{NOTE_GS4,374},{NOTE_D4,2249},{NOTE_D4,374},{NOTE_G4,561},{NOTE_AS4,187},{NOTE_A4,374},{NOTE_G4,750},{NOTE_D5,374},{NOTE_F5,750},{NOTE_E5,374},{NOTE_DS5,750},{NOTE_B4,374},{NOTE_DS5,561},{NOTE_D5,187},{NOTE_CS5,374},{NOTE_CS4,750},{NOTE_B4,374},{NOTE_G4,2249},{NOTE_AS4,374},{NOTE_D5,750},{NOTE_AS4,374},{NOTE_D5,750},{NOTE_AS4,374},{NOTE_DS5,750},{NOTE_D5,374},{NOTE_CS5,750},{NOTE_A4,374},{NOTE_AS4,561},{NOTE_D5,187},{NOTE_CS5,374},{NOTE_CS4,750},{NOTE_D4,374},{NOTE_D5,1700},{REST,150},{NOTE_AS4,374},{NOTE_D5,750},{NOTE_AS4,374},{NOTE_D5,750},{NOTE_AS4,374},{NOTE_F5,750},{NOTE_E5,374},{NOTE_DS5,750},{NOTE_B4,374},{NOTE_DS5,561},{NOTE_D5,187},{NOTE_CS5,374},{NOTE_CS4,750},{NOTE_AS4,374},{NOTE_G4,2249},{0,0}};
    struct Tone doom[]={{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,534},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,534},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,534},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_FS3,67},{NOTE_D3,67},{NOTE_B2,67},{NOTE_A3,67},{NOTE_FS3,67},{NOTE_B2,67},{NOTE_D3,67},{NOTE_FS3,67},{NOTE_A3,67},{NOTE_FS3,67},{NOTE_D3,67},{NOTE_B2,67},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,534},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B3,67},{NOTE_G3,67},{NOTE_E3,67},{NOTE_G3,67},{NOTE_B3,67},{NOTE_E4,67},{NOTE_G3,67},{NOTE_B3,67},{NOTE_E4,67},{NOTE_B3,67},{NOTE_G4,67},{NOTE_B4,67},{NOTE_A2,133},{NOTE_A2,133},{NOTE_A3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_G3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_F3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_DS3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_E3,133},{NOTE_F3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_A3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_G3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_F3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_DS3,534},{NOTE_A2,133},{NOTE_A2,133},{NOTE_A3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_G3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_F3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_DS3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_E3,133},{NOTE_F3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_A3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_G3,133},{NOTE_A2,133},{NOTE_A2,133},{NOTE_A3,67},{NOTE_F3,67},{NOTE_D3,67},{NOTE_A3,67},{NOTE_F3,67},{NOTE_D3,67},{NOTE_C4,67},{NOTE_A3,67},{NOTE_F3,67},{NOTE_A3,67},{NOTE_F3,67},{NOTE_D3,67},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,534},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,534},{NOTE_CS3,133},{NOTE_CS3,133},{NOTE_CS4,133},{NOTE_CS3,133},{NOTE_CS3,133},{NOTE_B3,133},{NOTE_CS3,133},{NOTE_CS3,133},{NOTE_A3,133},{NOTE_CS3,133},{NOTE_CS3,133},{NOTE_G3,133},{NOTE_CS3,133},{NOTE_CS3,133},{NOTE_GS3,133},{NOTE_A3,133},{NOTE_B2,133},{NOTE_B2,133},{NOTE_B3,133},{NOTE_B2,133},{NOTE_B2,133},{NOTE_A3,133},{NOTE_B2,133},{NOTE_B2,133},{NOTE_G3,133},{NOTE_B2,133},{NOTE_B2,133},{NOTE_F3,534},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B3,67},{NOTE_G3,67},{NOTE_E3,67},{NOTE_G3,67},{NOTE_B3,67},{NOTE_E4,67},{NOTE_G3,67},{NOTE_B3,67},{NOTE_E4,67},{NOTE_B3,67},{NOTE_G4,67},{NOTE_B4,67},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,534},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_D3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_AS2,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_B2,133},{NOTE_C3,133},{NOTE_E2,133},{NOTE_E2,133},{NOTE_E3,133},{NOTE_E2,133},{NOTE_E2,133},{0,0}};
    struct Tone fur_elise[] = {{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,-8},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,-8},{NOTE_E4,16},{NOTE_GS4,16},{NOTE_B4,16},{NOTE_C5,8},{REST,16},{NOTE_E4,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,-8},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,-8},{NOTE_E4,16},{NOTE_C5,16},{NOTE_B4,16},{NOTE_A4,4},{REST,8},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,-8},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,-8},{NOTE_E4,16},{NOTE_GS4,16},{NOTE_B4,16},{NOTE_C5,8},{REST,16},{NOTE_E4,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,-8},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,-8},{NOTE_E4,16},{NOTE_C5,16},{NOTE_B4,16},{NOTE_A4,8},{REST,16},{NOTE_B4,16},{NOTE_C5,16},{NOTE_D5,16},{NOTE_E5,-8},{NOTE_G4,16},{NOTE_F5,16},{NOTE_E5,16},{NOTE_D5,-8},{NOTE_F4,16},{NOTE_E5,16},{NOTE_D5,16},{NOTE_C5,-8},{NOTE_E4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_B4,8},{REST,16},{NOTE_E4,16},{NOTE_E5,16},{REST,16},{REST,16},{NOTE_E5,16},{NOTE_E6,16},{REST,16},{REST,16},{NOTE_DS5,16},{NOTE_E5,16},{REST,16},{REST,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,8},{REST,16},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,8},{REST,16},{NOTE_E4,16},{NOTE_GS4,16},{NOTE_B4,16},{NOTE_C5,8},{REST,16},{NOTE_E4,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,8},{REST,16},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,8},{REST,16},{NOTE_E4,16},{NOTE_C5,16},{NOTE_B4,16},{NOTE_A4,8},{REST,16},{NOTE_B4,16},{NOTE_C5,16},{NOTE_D5,16},{NOTE_E5,-8},{NOTE_G4,16},{NOTE_F5,16},{NOTE_E5,16},{NOTE_D5,-8},{NOTE_F4,16},{NOTE_E5,16},{NOTE_D5,16},{NOTE_C5,-8},{NOTE_E4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_B4,8},{REST,16},{NOTE_E4,16},{NOTE_E5,16},{REST,16},{REST,16},{NOTE_E5,16},{NOTE_E6,16},{REST,16},{REST,16},{NOTE_DS5,16},{NOTE_E5,16},{REST,16},{REST,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,8},{REST,16},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,8},{REST,16},{NOTE_E4,16},{NOTE_GS4,16},{NOTE_B4,16},{NOTE_C5,8},{REST,16},{NOTE_E4,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,8},{REST,16},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,8},{REST,16},{NOTE_E4,16},{NOTE_C5,16},{NOTE_B4,16},{NOTE_A4,8},{REST,16},{NOTE_C5,16},{NOTE_C5,16},{NOTE_C5,16},{NOTE_C5,4},{NOTE_F5,-16},{NOTE_E5,32},{NOTE_E5,8},{NOTE_D5,8},{NOTE_AS5,-16},{NOTE_A5,32},{NOTE_A5,16},{NOTE_G5,16},{NOTE_F5,16},{NOTE_E5,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_AS4,8},{NOTE_A4,8},{NOTE_A4,32},{NOTE_G4,32},{NOTE_A4,32},{NOTE_B4,32},{NOTE_C5,4},{NOTE_D5,16},{NOTE_DS5,16},{NOTE_E5,-8},{NOTE_E5,16},{NOTE_F5,16},{NOTE_A4,16},{NOTE_C5,4},{NOTE_D5,-16},{NOTE_B4,32},{NOTE_C5,32},{NOTE_G5,32},{NOTE_G4,32},{NOTE_G5,32},{NOTE_A4,32},{NOTE_G5,32},{NOTE_B4,32},{NOTE_G5,32},{NOTE_C5,32},{NOTE_G5,32},{NOTE_D5,32},{NOTE_G5,32},{NOTE_E5,32},{NOTE_G5,32},{NOTE_C6,32},{NOTE_B5,32},{NOTE_A5,32},{NOTE_G5,32},{NOTE_F5,32},{NOTE_E5,32},{NOTE_D5,32},{NOTE_G5,32},{NOTE_F5,32},{NOTE_D5,32},{NOTE_C5,32},{NOTE_G5,32},{NOTE_G4,32},{NOTE_G5,32},{NOTE_A4,32},{NOTE_G5,32},{NOTE_B4,32},{NOTE_G5,32},{NOTE_C5,32},{NOTE_G5,32},{NOTE_D5,32},{NOTE_G5,32},{NOTE_E5,32},{NOTE_G5,32},{NOTE_C6,32},{NOTE_B5,32},{NOTE_A5,32},{NOTE_G5,32},{NOTE_F5,32},{NOTE_E5,32},{NOTE_D5,32},{NOTE_G5,32},{NOTE_F5,32},{NOTE_D5,32},{NOTE_E5,32},{NOTE_F5,32},{NOTE_E5,32},{NOTE_DS5,32},{NOTE_E5,32},{NOTE_B4,32},{NOTE_E5,32},{NOTE_DS5,32},{NOTE_E5,32},{NOTE_B4,32},{NOTE_E5,32},{NOTE_DS5,32},{NOTE_E5,-8},{NOTE_B4,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,-8},{NOTE_B4,16},{NOTE_E5,16},{REST,16},{REST,16},{NOTE_DS5,16},{NOTE_E5,16},{REST,16},{REST,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,8},{REST,16},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,8},{REST,16},{NOTE_E4,16},{NOTE_GS4,16},{NOTE_B4,16},{NOTE_C5,8},{REST,16},{NOTE_E4,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,8},{REST,16},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,8},{REST,16},{NOTE_E4,16},{NOTE_C5,16},{NOTE_B4,16},{NOTE_A4,8},{REST,16},{NOTE_B4,16},{NOTE_C5,16},{NOTE_D5,16},{NOTE_E5,-8},{NOTE_G4,16},{NOTE_F5,16},{NOTE_E5,16},{NOTE_D5,-8},{NOTE_F4,16},{NOTE_E5,16},{NOTE_D5,16},{NOTE_C5,-8},{NOTE_E4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_B4,8},{REST,16},{NOTE_E4,16},{NOTE_E5,16},{REST,16},{REST,16},{NOTE_E5,16},{NOTE_E6,16},{REST,16},{REST,16},{NOTE_DS5,16},{NOTE_E5,16},{REST,16},{REST,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_D5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,8},{REST,16},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,8},{REST,16},{NOTE_E4,16},{NOTE_GS4,16},{NOTE_B4,16},{NOTE_C5,8},{REST,16},{NOTE_E4,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,8},{REST,16},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,8},{REST,16},{NOTE_E4,16},{NOTE_C5,16},{NOTE_B4,16},{NOTE_A4,8},{REST,16},{REST,16},{REST,8},{NOTE_CS5,-4},{NOTE_D5,4},{NOTE_E5,16},{NOTE_F5,16},{NOTE_F5,4},{NOTE_F5,8},{NOTE_E5,-4},{NOTE_D5,4},{NOTE_C5,16},{NOTE_B4,16},{NOTE_A4,4},{NOTE_A4,8},{NOTE_A4,8},{NOTE_C5,8},{NOTE_B4,8},{NOTE_A4,-4},{NOTE_CS5,-4},{NOTE_D5,4},{NOTE_E5,16},{NOTE_F5,16},{NOTE_F5,4},{NOTE_F5,8},{NOTE_F5,-4},{NOTE_DS5,4},{NOTE_D5,16},{NOTE_C5,16},{NOTE_AS4,4},{NOTE_A4,8},{NOTE_GS4,4},{NOTE_G4,8},{NOTE_A4,-4},{NOTE_B4,4},{REST,8},{NOTE_A3,-32},{NOTE_C4,-32},{NOTE_E4,-32},{NOTE_A4,-32},{NOTE_C5,-32},{NOTE_E5,-32},{NOTE_D5,-32},{NOTE_C5,-32},{NOTE_B4,-32},{NOTE_A4,-32},{NOTE_C5,-32},{NOTE_E5,-32},{NOTE_A5,-32},{NOTE_C6,-32},{NOTE_E6,-32},{NOTE_D6,-32},{NOTE_C6,-32},{NOTE_B5,-32},{NOTE_A4,-32},{NOTE_C5,-32},{NOTE_E5,-32},{NOTE_A5,-32},{NOTE_C6,-32},{NOTE_E6,-32},{NOTE_D6,-32},{NOTE_C6,-32},{NOTE_B5,-32},{NOTE_AS5,-32},{NOTE_A5,-32},{NOTE_GS5,-32},{NOTE_G5,-32},{NOTE_FS5,-32},{NOTE_F5,-32},{NOTE_E5,-32},{NOTE_DS5,-32},{NOTE_D5,-32},{NOTE_CS5,-32},{NOTE_C5,-32},{NOTE_B4,-32},{NOTE_AS4,-32},{NOTE_A4,-32},{NOTE_GS4,-32},{NOTE_G4,-32},{NOTE_FS4,-32},{NOTE_F4,-32},{NOTE_E4,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,-8},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,-8},{NOTE_E4,16},{NOTE_GS4,16},{NOTE_B4,16},{NOTE_C5,8},{REST,16},{NOTE_E4,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,-8},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,-8},{NOTE_E4,16},{NOTE_C5,16},{NOTE_B4,16},{NOTE_A4,-8},{REST,-8},{REST,-8},{NOTE_G4,16},{NOTE_F5,16},{NOTE_E5,16},{NOTE_D5,4},{REST,8},{REST,-8},{NOTE_E4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_B4,-8},{NOTE_E4,16},{NOTE_E5,8},{NOTE_E5,8},{NOTE_E6,-8},{NOTE_DS5,16},{NOTE_E5,16},{REST,16},{REST,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,-8},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,-8},{NOTE_E4,16},{NOTE_GS4,16},{NOTE_B4,16},{NOTE_C5,8},{REST,16},{NOTE_E4,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_DS5,16},{NOTE_E5,16},{NOTE_B4,16},{NOTE_D5,16},{NOTE_C5,16},{NOTE_A4,-8},{NOTE_C4,16},{NOTE_E4,16},{NOTE_A4,16},{NOTE_B4,-8},{NOTE_E4,16},{NOTE_C5,16},{NOTE_B4,16},{NOTE_A4,-4}};
    // Insert tones into dictionary
    insert(playlist, "super_mario_bros", 0, super_mario_bros, sizeof(super_mario_bros) / sizeof(struct Tone));
    insert(playlist, "hedwig_theme", 1, hedwig_theme, sizeof(hedwig_theme) / sizeof(struct Tone));
    insert(playlist, "doom", 2, doom, sizeof(doom) / sizeof(struct Tone));
    insert(playlist, "fur_elise", 3, fur_elise, sizeof(fur_elise) / sizeof(struct Tone));




